require 'spec_helper'

describe ZipConverter do
  describe 'concat_post_code_table' do
    subject { concat_post_code_table(csv_string) }
    let(:csv_string) { <<~CSV }
      26102,"602  ","6020824","キョウトフ","キョウトシカミギョウク","イッシンチョウ","京都府","京都市上京区","一真町",0,0,0,0,0,0
      26102,"602  ","6028272","キョウトフ","キョウトシカミギョウク","カメキチョウ","京都府","京都市上京区","亀木町",0,0,0,0,0,0
      26102,"602  ","6028062","キョウトフ","キョウトシカミギョウク","カメヤチョウ","京都府","京都市上京区","亀屋町（油小路通上長者町下る、油小路通下長者町上る、油小路通",0,0,0,0,0,0
      26102,"602  ","6028062","キョウトフ","キョウトシカミギョウク","カメヤチョウ","京都府","京都市上京区","中長者町上る、油小路通中長者町下る、上長者町通油小路西入、上長者町通油小",0,0,0,0,0,0
      26102,"602  ","6028062","キョウトフ","キョウトシカミギョウク","カメヤチョウ","京都府","京都市上京区","路東入）",0,0,0,0,0,0
      26102,"602  ","6028272","キョウトフ","キョウトシカミギョウク","カメキチョウ","京都府","京都市上京区","亀木町2(架空)",0,0,0,0,0,0
    CSV
    it 'concat divided record and construct table' do
      is_expected.to eq({
        '6020824' => [['26102', '602  ', '6020824', 'キョウトフ', 'キョウトシカミギョウク', 'イッシンチョウ',
          '京都府', '京都市上京区', '一真町', '0', '0', '0', '0', '0', '0']],
        '6028272' => [
          [
            '26102', '602  ', '6028272', 'キョウトフ', 'キョウトシカミギョウク', 'カメキチョウ',
            '京都府', '京都市上京区', '亀木町', '0', '0', '0', '0', '0', '0'
          ], [
            '26102', '602  ', '6028272', 'キョウトフ', 'キョウトシカミギョウク', 'カメキチョウ',
            '京都府', '京都市上京区', '亀木町2(架空)', '0', '0', '0', '0', '0', '0'
          ],
        ],
        '6028062' => [
          [
            '26102', '602  ', '6028062', 'キョウトフ', 'キョウトシカミギョウク', 'カメヤチョウ', '京都府', '京都市上京区',
            '亀屋町（油小路通上長者町下る、油小路通下長者町上る、油小路通', '0', '0', '0', '0', '0', '0'
          ], [
            '26102', '602  ', '6028062', 'キョウトフ', 'キョウトシカミギョウク', 'カメヤチョウ', '京都府', '京都市上京区',
            '中長者町上る、油小路通中長者町下る、上長者町通油小路西入、上長者町通油小', '0', '0', '0', '0', '0', '0'
          ],[
            '26102', '602  ', '6028062', 'キョウトフ', 'キョウトシカミギョウク', 'カメヤチョウ', '京都府', '京都市上京区',
            '路東入）', '0', '0', '0', '0', '0', '0'
          ],
        ]
      })
    end
  end
end
